/**
 * 2.3.2 变量和数据类型
 */

// ================================================================== 变量 ==================================================================
//在Java中，变量分为两种：基本类型的变量和引用类型的变量。



// ================================================================== 基础变量 ==================================================================
//在Java中，变量必须先定义后使用，在定义变量的时候，可以给它一个初始值。例如：

//public class Main {
//    public static void main(String[] args) {
//        int x = 100;
//        System.out.println("变量x为：" + x);
//    }
//}

//如果不写初始值，就相当于给它指定了默认值。默认值总是0。





//变量的一个重要特点是可以重新赋值。例如，对变量x，先赋值100，再赋值200。
//public class Main {
//    public static void main(String[] args) {
//        int x = 100;
//        System.out.println("变量x为：" + x);
//        x = 200;
//        System.out.println("变量x修改后为：" + x);
//    }
//}

//注意到第一次定义变量x的时候，需要指定变量类型int，因此使用语句int x = 100;。
// 而第二次重新赋值的时候，变量x已经存在了，不能再重复定义，因此不能指定变量类型int，必须使用语句x = 200;。




// 变量不但可以重新赋值，还可以赋值给其他变量。
//public class Main {
//    public static void main(String[] args) {
//        int n = 100; // 定义变量n，同时赋值为100
//        System.out.println("n = " + n); // n = 100
//
//        n = 200; // 变量n赋值为200
//        System.out.println("n = " + n); // n = 200
//
//        int x = n; // 变量x赋值为n（n的值为200，因此赋值后x的值也是200）
//        System.out.println("x = " + x); // x = 200
//
//        x = x + 100; // 变量x赋值为x+100（x的值为200，因此赋值后x的值是200+100=300）
//        System.out.println("x = " + x); // x = 300
//        System.out.println("n = " + n); // n = 200
//    }
//}

//逐行分析上面代码示例执行流程
//1. int n = 100;
//执行int n = 100;，该语句定义了变量n，同时赋值为100，因此，JVM在内存中为变量n分配一个“存储单元”，填入值100：
//        n
//        |
//        ▼
//  ┌───┬───┬───┬───┬───┬───┬───┐
//  │   │100│   │   │   │   │   │
//  └───┴───┴───┴───┴───┴───┴───┘
//
//2. n = 200;
//执行n = 200;时，JVM把200写入变量n的存储单元，因此，原有的值被覆盖，现在n的值为200：
//      n
//      |
//      ▼
//┌───┬───┬───┬───┬───┬───┬───┐
//│   │200│   │   │   │   │   │
//└───┴───┴───┴───┴───┴───┴───┘
//
//
//3. int x = n;
//执行int x = n;时，定义了一个新的变量x，同时对x赋值，因此，JVM需要新分配一个存储单元给变量x，并写入和变量n一样的值，结果是变量x的值也变为200：
//      n           x
//      │           │
//      ▼           ▼
//┌───┬───┬───┬───┬───┬───┬───┐
//│   │200│   │   │200│   │   │
//└───┴───┴───┴───┴───┴───┴───┘
//
//
//4. x = x + 100;
//执行x = x + 100;时，JVM首先计算等式右边的值x + 100，结果为300（因为此刻x的值为200），然后，将结果300写入x的存储单元，因此，变量x最终的值变为300：
//      n           x
//      │           │
//      ▼           ▼
//┌───┬───┬───┬───┬───┬───┬───┐
//│   │200│   │   │300│   │   │
//└───┴───┴───┴───┴───┴───┴───┘
//
//
//可见，变量可以反复赋值。












// ================================================================== 计算机内存的基本结构 ==================================================================

//计算机内存的最小存储单元是字节（byte），一个字节就是一个8位二进制数，即8个bit。它的二进制表示范围从00000000~11111111，换算成十进制是0~255，换算成十六进制是00~ff。

//内存单元从0开始编号，称为内存地址。每个内存单元可以看作一间房间，内存地址就是门牌号。
//  0   1   2   3   4   5   6  ...
//┌───┬───┬───┬───┬───┬───┬───┐
//│   │   │   │   │   │   │   │...
//└───┴───┴───┴───┴───┴───┴───┘


//一个字节是1byte，1024字节是1K，1024K是1M，1024M是1G，1024G是1T。一个拥有4T内存的计算机的字节数量就是：
//4T = 4 x 1024G
//   = 4 x 1024 x 1024M
//   = 4 x 1024 x 1024 x 1024K
//   = 4 x 1024 x 1024 x 1024 x 1024byte
//   = 4398046511104byte





// ================================================================== 基本数据类型 ==================================================================
//基本数据类型是CPU可以直接进行运算的类型。Java定义了以下几种基本数据类型：
//
//整数类型：byte，short，int，long
//浮点数类型：float，double
//字符类型：char
//布尔类型：boolean

//不同的数据类型占用的字节数不一样。我们看一下Java基本数据类型占用的字节数：
//        ┌───┐
//byte    │   │
//        └───┘
//        ┌───┬───┐
//short   │   │   │
//        └───┴───┘
//        ┌───┬───┬───┬───┐
//int     │   │   │   │   │
//        └───┴───┴───┴───┘
//        ┌───┬───┬───┬───┬───┬───┬───┬───┐
//long    │   │   │   │   │   │   │   │   │
//        └───┴───┴───┴───┴───┴───┴───┴───┘
//        ┌───┬───┬───┬───┐
//float   │   │   │   │   │
//        └───┴───┴───┴───┘
//        ┌───┬───┬───┬───┬───┬───┬───┬───┐
//double  │   │   │   │   │   │   │   │   │
//        └───┴───┴───┴───┴───┴───┴───┴───┘
//        ┌───┬───┐
//char    │   │   │
//        └───┴───┘
//
//byte恰好就是一个字节，而long和double需要8个字节。







// ================================================================== 整型 ==================================================================
//对于整型类型，Java只定义了带符号的整型，因此，最高位的bit表示符号位（0表示正数，1表示负数）。各种整型能表示的最大范围如下：
//byte：   -128 ~ 127
//short:  -32768 ~ 32767
//int:    -2147483648 ~ 2147483647
//long:   -9223372036854775808 ~ 9223372036854775807

//public class Main {
//    public static void main(String[] args) {
//        int i = 2147483647;
//        int i2 = -2147483648;
//        int i3 = 2_000_000_000; // 加下划线更容易识别
//        int i4 = 0xff0000; // 十六进制表示的16711680
//        int i5 = 0b1000000000; // 二进制表示的512
//
//        long n1 = 9000000000000000000L; // long型的结尾需要加L
//        long n2 = 900; // 没有加L，此处900为int，但int类型可以赋值给long
//        int i6 = 900L; // 错误：不能把long型赋值给int
//    }
//}
//特别注意：同一个数的不同进制的表示是完全相同的，例如15=0xf＝0b1111。



//public class Main {
//    public static void main(String[] args) {
////        // 赋值超过范围的值
////        int i = 2147483647;
////        System.out.println(i); // 可以打印出来
////
////        int i1 = 2147483649;
////        System.out.println(i1); // 报错：错误: 整数太大
//
//
////        // 赋值其它类型的值
////        int i2 = 100L;
////        System.out.println(i2); // 报错：错误: 不兼容的类型: 从long转换到int可能会有损失
//
////        int i3 = "123";
////        System.out.println(i3); // 报错：错误: 不兼容的类型: String无法转换为int
//    }
//}





// ================================================================== 浮点型 ==================================================================
//浮点类型的数就是小数，因为小数用科学计数法表示的时候，小数点是可以“浮动”的，如1234.5可以表示成12.345x102，也可以表示成1.2345x103，所以称为浮点数。
//下面是定义浮点数的例子：
//float f1 = 3.14f;
//float f2 = 3.14e38f; // 科学计数法表示的3.14x10^38
//float f3 = 1.0; // 错误：不带f结尾的是double类型，不能赋值给float
//
//double d = 1.79e308;
//double d2 = -1.79e308;
//double d3 = 4.9e-324; // 科学计数法表示的4.9x10^-324

//对于float类型，需要加上f后缀。

//浮点数可表示的范围非常大，float类型可最大表示3.4x1038，而double类型可最大表示1.79x10308。









// ================================================================== 布尔类型 ==================================================================
//布尔类型boolean只有true和false两个值，布尔类型总是关系运算的计算结果：
//boolean b1 = true;
//boolean b2 = false;
//boolean isGreater = 5 > 3; // 计算结果为true
//int age = 12;
//boolean isAdult = age >= 18; // 计算结果为false

//Java语言对布尔类型的存储并没有做规定，因为理论上存储布尔类型只需要1 bit，但是通常JVM内部会把boolean表示为4字节整数。









// ================================================================== 字符类型 ==================================================================
//字符类型char表示一个字符。Java的char类型除了可表示标准的ASCII外，还可以表示一个Unicode字符：

// 字符类型
//public class Main {
//    public static void main(String[] args) {
//        char a = 'A';
//        char zh = '中';
//        System.out.println(a); // ==> A
//        System.out.println(zh);// ==> 中
//    }
//}

//注意char类型使用单引号'，且仅有一个字符，要和双引号"的字符串类型区分开。











// ================================================================== 引用类型 ==================================================================
//除了上述基本类型的变量，剩下的都是引用类型。例如，引用类型最常用的就是String字符串：
//String s = "hello";
//引用类型的变量类似于C语言的指针，它内部存储一个“地址”，指向某个对象在内存的位置，







// ================================================================== 常量 ==================================================================
//定义变量的时候，如果加上final修饰符，这个变量就变成了常量：
//常量在定义时进行初始化后就不可再次赋值，再次赋值会导致编译错误。
//public class Main {
//    public static void main(String[] args) {
//        final double PI = 3.14; // PI是一个常量
//        PI = 300; // ==> 错误: 无法为 final 变量 PI 分配值
//    }
//}

//为了和变量区分开来，根据习惯，常量名通常全部大写。








// ================================================================== var关键字 ==================================================================
//有些时候，类型的名字太长，写起来比较麻烦。例如：
//StringBuilder sb = new StringBuilder();
//
//这个时候，如果想省略变量类型，可以使用var关键字：
//var sb = new StringBuilder();
//
//编译器会根据赋值语句自动推断出变量sb的类型是StringBuilder。对编译器来说，语句：
//var sb = new StringBuilder();
//
//实际上会自动变成：
//StringBuilder sb = new StringBuilder();
//
//因此，使用var定义变量，仅仅是少写了变量类型而已。










// ================================================================== 变量的作用范围 ==================================================================
//{
//    ...
//    int i = 0; // 变量i从这里开始定义
//    ...
//    {
//        ...
//        int x = 1; // 变量x从这里开始定义
//        ...
//        {
//            ...
//            String s = "hello"; // 变量s从这里开始定义
//            ...
//        } // 变量s作用域到此结束
//        ...
//        // 注意，这是一个新的变量s，它和上面的变量同名，
//        // 但是因为作用域不同，它们是两个不同的变量:
//        String s = "hi";
//        ...
//    } // 变量x和s作用域到此结束
//    ...
//} // 变量i作用域到此结束


//public class Main {
//    public static void main(String[] args) {
//        int i = 1;
//
//        if (true) {
//            int i2 = 2;
//            System.out.println("i2=" + i2); // ==> i2=2
//
//            if (true) {
//                int i3 = 3;
//                System.out.println("i3=" + i3); // ==> i3=3
//            }
//
//            int i3 = 33;
//            System.out.println("i33=" + i3); // ==> i33=33
//        }
//
//        System.out.println("i="+i); // ==> i=1
//    }
//}


//定义变量时，要遵循作用域最小化原则，尽量将变量定义在尽可能小的作用域，并且，不要重复使用变量名。









// ================================================================== 小结 ==================================================================
//Java提供了两种变量类型：基本类型和引用类型
//基本类型包括：整型，浮点型，布尔型，字符型。
//引用类型包括：除了基本类型之外的变量，剩下的都是引用类型。
//变量可重新赋值，等号是赋值语句，不是数学意义的等号。

//常量在初始化后不可重新赋值，使用常量便于理解程序意图。






























































































