/**
 * 2.3.4 浮点数运算
 */

//浮点数运算和整数运算相比，只能进行加减乘除这些数值计算，不能做位运算和移位运算。

//在计算机中，浮点数虽然表示的范围大，但是，浮点数有个非常重要的特点，就是浮点数常常无法精确表示。
//举个例子：
//浮点数0.1在计算机中就无法精确表示，因为十进制的0.1换算成二进制是一个无限循环小数，很显然，无论使用float还是double，都只能存储一个0.1的近似值。但是，0.5这个浮点数又可以精确地表示。
//因为浮点数常常无法精确表示，因此，浮点数运算会产生误差：
// 浮点数运算误差
//public class Main {
//    public static void main(String[] args) {
//        double x = 1.0 / 10;
//        double y = 1 - 9.0 / 10;
//        // 观察x和y是否相等:
//        System.out.println(x); // ==> 0.1
//        System.out.println(y); // ==> 0.09999999999999998
//    }
//}


//由于浮点数存在运算误差，所以比较两个浮点数是否相等常常会出现错误的结果。正确的比较方法是判断两个浮点数之差的绝对值是否小于一个很小的数：
// 比较x和y是否相等，先计算其差的绝对值:
//public class Main {
//    public static void main(String[] args) {
//        // 比较x和y是否相等，先计算其差的绝对值:
//        double r = Math.abs(x - y);
//        // 再判断绝对值是否足够小:
//        if (r < 0.00001) {
//            // 可以认为相等
//        } else {
//            // 不相等
//        }
//    }
//}


//浮点数在内存的表示方法和整数比更加复杂。Java的浮点数完全遵循IEEE-754标准(https://standards.ieee.org/ieee/754/6210/)，这也是绝大多数计算机平台都支持的浮点数标准表示方法。















// ================================================================== 类型提升 ==================================================================
//如果参与运算的两个数其中一个是整型，那么整型可以自动提升到浮点型：
// 类型提升
//public class Main {
//    public static void main(String[] args) {
//        int n = 5;
//        double d = 1.2 + 24.0 / n;
//        System.out.println(d); // 1.2 + 4.8 = 6.0
//    }
//}

//需要特别注意，在一个复杂的四则运算中，两个整数的运算不会出现自动提升的情况。例如：
//public  class Main {
//    public static void main(String[] args) {
//        double d = 1.2 + 24 / 5; // 结果不是 6.0 而是 5.2
//        System.out.println(d); // 1.2 + 4.0 = 5.2  // 原因：编译器计算24 / 5这个子表达式时，按两个整数进行运算，结果仍为整数4。
//    }
//}
//要修复这个计算结果，可以将24 / 5改为24.0 / 5。由于24.0是浮点数，因此，计算除法时自动将5提升为浮点数。
//public class Main {
//    public static void main(String[] args) {
//        double d = 1.2 + 24.0 / 5; // 结果不是 6.0 而是 5.2
//        System.out.println(d); // 1.2 + 4.8 = 6.0
//    }
//}
















// ================================================================== 溢出 ==================================================================
//整数运算在除数为0时会报错，而浮点数运算在除数为0时，不会报错，但会返回几个特殊值：
//  NaN表示Not a Number
//  Infinity表示无穷大
//  -Infinity表示负无穷大

//double d1 = 0.0 / 0; // NaN
//double d2 = 1.0 / 0; // Infinity
//double d3 = -1.0 / 0; // -Infinity

















// ================================================================== 强制转型 ==================================================================
//可以将浮点数强制转型为整数。在转型时，浮点数的小数部分会被丢掉。如果转型后超过了整型能表示的最大范围，将返回整型的最大值。例如：
//public class Main {
//    public static void main(String[] args) {
//        int n1 = (int) 12.3;
//        System.out.println(n1); // 12
//
//        int n2 = (int) 12.7;
//        System.out.println(n2); // 12
//
//        int n3 = (int) -12.7;
//        System.out.println(n3); // -12
//
//        int n4 = (int) (12.7 + 0.5);
//        System.out.println(n4); // 13
//
//        int n5 = (int) 1.2e20; // int范围：-2147483648 ~ 2147483647
//        System.out.println(n5); // 2147483647
//    }
//}


//如果要进行四舍五入，可以对浮点数加上0.5再强制转型：
// 四舍五入
//public class Main {
//    public static void main(String[] args) {
//        double d = 2.1;
//        int n = (int) (d + 0.5);
//        System.out.println(n); // ==> 2
//
//        double d2 = 2.6;
//        int n2 = (int) (d2 + 0.5);
//        System.out.println(n2); // ==> 3
//    }
//}
//












































































































































